performance/jmeter/results/html-report/statistics.json
{
  "03 - GET Consulta progreso" : {
    "transaction" : "03 - GET Consulta progreso",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 359.0,
    "medianResTime" : 336.5,
    "minResTime" : 311.0,
    "maxResTime" : 521.0,
    "pct1ResTime" : 416.6,
    "pct2ResTime" : 493.54999999999984,
    "pct3ResTime" : 521.0,
    "throughput" : 3.610368979709726,
    "receivedKBytesPerSec" : 1.4314548884395986,
    "sentKBytesPerSec" : 0.6029034136038703
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 364.3049999999999,
    "medianResTime" : 337.5,
    "minResTime" : 307.0,
    "maxResTime" : 1189.0,
    "pct1ResTime" : 417.9,
    "pct2ResTime" : 475.4499999999999,
    "pct3ResTime" : 688.7200000000012,
    "throughput" : 12.567550584391102,
    "receivedKBytesPerSec" : 9.803978120679904,
    "sentKBytesPerSec" : 2.8721885014766873
  },
  "02 - POST Login" : {
    "transaction" : "02 - POST Login",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 356.35999999999996,
    "medianResTime" : 333.0,
    "minResTime" : 309.0,
    "maxResTime" : 530.0,
    "pct1ResTime" : 419.9,
    "pct2ResTime" : 474.8499999999996,
    "pct3ResTime" : 530.0,
    "throughput" : 3.5968635349974822,
    "receivedKBytesPerSec" : 2.932989308323142,
    "sentKBytesPerSec" : 0.8711153873822027
  },
  "04 - POST Inscripcion" : {
    "transaction" : "04 - POST Inscripcion",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 365.52000000000004,
    "medianResTime" : 346.0,
    "minResTime" : 307.0,
    "maxResTime" : 690.0,
    "pct1ResTime" : 413.6,
    "pct2ResTime" : 562.0,
    "pct3ResTime" : 690.0,
    "throughput" : 3.659250585480094,
    "receivedKBytesPerSec" : 3.687838480679157,
    "sentKBytesPerSec" : 0.7718731703747073
  },
  "01 - POST Registro" : {
    "transaction" : "01 - POST Registro",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 376.34,
    "medianResTime" : 354.0,
    "minResTime" : 308.0,
    "maxResTime" : 1189.0,
    "pct1ResTime" : 429.09999999999997,
    "pct2ResTime" : 489.2999999999998,
    "pct3ResTime" : 1189.0,
    "throughput" : 3.3806626098715347,
    "receivedKBytesPerSec" : 3.0449073487153484,
    "sentKBytesPerSec" : 0.9940600701487492
  }
}