performance/jmeter/results/html-report/statistics.json
{
  "03 - GET Consulta progreso" : {
    "transaction" : "03 - GET Consulta progreso",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 363.70000000000005,
    "medianResTime" : 336.5,
    "minResTime" : 306.0,
    "maxResTime" : 836.0,
    "pct1ResTime" : 414.7,
    "pct2ResTime" : 453.3499999999999,
    "pct3ResTime" : 836.0,
    "throughput" : 3.702880841294527,
    "receivedKBytesPerSec" : 1.4681343960601347,
    "sentKBytesPerSec" : 0.6183521717396134
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 372.80500000000006,
    "medianResTime" : 338.5,
    "minResTime" : 306.0,
    "maxResTime" : 1657.0,
    "pct1ResTime" : 421.70000000000005,
    "pct2ResTime" : 482.9,
    "pct3ResTime" : 1045.880000000002,
    "throughput" : 12.58890917102033,
    "receivedKBytesPerSec" : 9.820640008340153,
    "sentKBytesPerSec" : 2.877069793699251
  },
  "02 - POST Login" : {
    "transaction" : "02 - POST Login",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 353.52000000000004,
    "medianResTime" : 339.5,
    "minResTime" : 307.0,
    "maxResTime" : 431.0,
    "pct1ResTime" : 409.09999999999997,
    "pct2ResTime" : 417.34999999999997,
    "pct3ResTime" : 431.0,
    "throughput" : 3.705075954057058,
    "receivedKBytesPerSec" : 3.0212289273805113,
    "sentKBytesPerSec" : 0.8973230826231938
  },
  "04 - POST Inscripcion" : {
    "transaction" : "04 - POST Inscripcion",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 356.34000000000003,
    "medianResTime" : 334.0,
    "minResTime" : 309.0,
    "maxResTime" : 481.0,
    "pct1ResTime" : 399.0,
    "pct2ResTime" : 451.29999999999984,
    "pct3ResTime" : 481.0,
    "throughput" : 3.730786449783614,
    "receivedKBytesPerSec" : 3.759933218922549,
    "sentKBytesPerSec" : 0.7869627667512312
  },
  "01 - POST Registro" : {
    "transaction" : "01 - POST Registro",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 417.66,
    "medianResTime" : 361.5,
    "minResTime" : 310.0,
    "maxResTime" : 1657.0,
    "pct1ResTime" : 504.8,
    "pct2ResTime" : 810.3999999999982,
    "pct3ResTime" : 1657.0,
    "throughput" : 3.369272237196766,
    "receivedKBytesPerSec" : 3.0346482269204853,
    "sentKBytesPerSec" : 0.9907108111522911
  }
}